luxuryJXHZ/tm4c/tm4c23gh6pm/pwm/tm4c/USER/main.c
#include <stdbool.h>
#include "stdbool.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "inc/hw_gpio.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "inc/hw_nvic.h"
#include "inc/hw_flash.h"
#include "inc/hw_adc.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_timer.h"
#include "inc/hw_pwm.h"

#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/gpio.h"
#include "driverlib/timer.h"
#include "driverlib/pin_map.h"
#include "driverlib/systick.h"
#include "driverlib/ssi.h"
#include "driverlib/adc.h"
#include "driverlib/cpu.h"
#include "driverlib/uart.h"
#include "driverlib/pwm.h"
void PWM_init();
void LED_Config(void);
void PWM_duty(uint32_t ui32Base,uint32_t ui32PWMOut,uint32_t ui32PWMOutBits,uint32_t ui32Gen,float duty);
int main(void)
	{
float d=0.01;
float duty=0.1;
_Bool flag=0;
		PWM_init();
		
	
	while(1)
	{	duty+=d;
		if(duty>0.9)
		{
		    d=-0.01;
		}
		else if(duty<0.1)
		{
		    d=0.01;
			flag=!flag;
		}
		if(flag==0)
		{
		    PWM_duty( PWM1_BASE, PWM_OUT_6, PWM_OUT_6_BIT, PWM_GEN_3, duty);
		}
		else
		{
		    PWM_duty( PWM1_BASE, PWM_OUT_7, PWM_OUT_7_BIT, PWM_GEN_3, duty);
		}
		SysCtlDelay(SysCtlClockGet()/3000*10);
	}
}
void PWM_init()
{	SysCtlClockSet(SYSCTL_SYSDIV_5 |SYSCTL_XTAL_16MHZ|SYSCTL_USE_PLL|SYSCTL_OSC_MAIN);
		SysCtlPWMClockSet(SYSCTL_PWMDIV_4);
		SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
		SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM1);
		
		GPIOPinTypePWM(GPIO_PORTF_BASE,GPIO_PIN_2);
		GPIOPinTypePWM(GPIO_PORTF_BASE,GPIO_PIN_3);
		GPIOPinConfigure(GPIO_PF2_M1PWM6);
		GPIOPinConfigure(GPIO_PF3_M1PWM7);
		
		PWMGenConfigure(PWM1_BASE,PWM_GEN_3,PWM_GEN_MODE_DOWN|PWM_GEN_MODE_UP_DOWN);
		PWMGenPeriodSet(PWM1_BASE,PWM_GEN_3,2000);
		PWMPulseWidthSet(PWM1_BASE,PWM_OUT_6,PWMGenPeriodGet(PWM1_BASE,PWM_GEN_3)*0.1-1);
		PWMPulseWidthSet(PWM1_BASE,PWM_OUT_7,PWMGenPeriodGet(PWM1_BASE,PWM_GEN_3)*0.1-1);
		PWMOutputState(PWM1_BASE,PWM_OUT_6_BIT,true);
		PWMOutputState(PWM1_BASE,PWM_OUT_7_BIT,true);
		PWMGenEnable(PWM1_BASE,PWM_GEN_3);
}
                          
void PWM_duty(uint32_t ui32Base,uint32_t ui32PWMOut,uint32_t ui32PWMOutBits,uint32_t ui32Gen,float duty)
{
    PWMPulseWidthSet( ui32Base,  ui32PWMOut,
                              PWMGenPeriodGet(ui32Base, ui32Gen)*duty - 1);
	PWMOutputState( ui32Base,  ui32PWMOutBits,
                            true);
	PWMGenEnable( ui32Base,  ui32Gen);
}
	
void LED_Config(void)
{
	SysCtlPeripheralEnable( SYSCTL_PERIPH_GPIOF);
	GPIODirModeSet( GPIO_PORTF_BASE,  GPIO_PIN_2|GPIO_PIN_3,
                            GPIO_DIR_MODE_OUT);
	GPIOPadConfigSet( GPIO_PORTF_BASE,  GPIO_PIN_2|GPIO_PIN_3,
                              GPIO_STRENGTH_2MA,  GPIO_PIN_TYPE_STD);
}